In [2]:
import pandas as pd
df = pd.read_excel('pandas_code.xlsx')
df.describe()
df['수학'].describe()

count    1000.000000
mean       72.397000
std        16.236595
min        45.000000
25%        59.000000
50%        72.000000
75%        86.000000
max       100.000000
Name: 수학, dtype: float64

In [3]:
df['수학'].min()

np.int64(45)

In [4]:
df['수학'].max()

np.int64(100)

In [5]:
df['수학'].mean()

np.float64(72.397)

In [6]:
df['수학'].std()

np.float64(16.236595025374562)

In [ ]:
df['수학'].nlargest(3) # 최대값 3명 출력

58     100
128    100
173    100
Name: 수학, dtype: int64

In [ ]:
df['수학'].nsmallest(3) # 최소값 3명 출력

In [9]:
df = pd.read_excel('score.xlsx')
df['키'].min()

np.int64(168)

In [10]:
df['키'].max()

np.int64(202)

In [11]:
df['키'].mean()

np.float64(188.0)

In [12]:
df['키'].nlargest()

5    202
0    197
7    190
4    188
6    188
Name: 키, dtype: int64

In [13]:
df['키'].nsmallest()

2    168
1    184
3    187
4    188
6    188
Name: 키, dtype: int64

In [16]:
df['SW특기'].count()

np.int64(8)

In [ ]:
df['학교'].unique() # 중복 제거 데이터 확인

array(['구로고', '가산고'], dtype=object)

In [ ]:
df['학교'].nunique() # 중복제거 개수 확인

2

In [19]:
df[['키','이름','학교']]

     키   이름   학교
0  197  강나래  구로고
1  184  강태원  구로고
2  168  강호림  가산고
3  187  김수찬  구로고
4  188  김재욱  가산고
5  202  박동현  가산고
6  188  박혜정  구로고
7  190  승근열  구로고

In [22]:
df[['키']]

     키
0  197
1  184
2  168
3  187
4  188
5  202
6  188
7  190

In [23]:
df.columns

Index(['지원번호', '이름', '학교', '키', '국어', '영어', '수학', '사회', 'SW특기'], dtype='object')

In [24]:
df.columns[0]

'지원번호'

In [25]:
df.columns[2:5]

Index(['학교', '키', '국어'], dtype='object')

In [ ]:
df['이름']

0    강나래
1    강태원
2    강호림
3    김수찬
4    김재욱
5    박동현
6    박혜정
7    승근열
Name: 이름, dtype: object

In [27]:
df.columns[-1]

'SW특기'

In [ ]:
df[df.columns[[0,3,-1]]] # 0번째, 3번째, 마지막 컬럼 내용 확인

  지원번호    키        SW특기
0   1번  197      Python
1   2번  184        Java
2   3번  168  Javascript
3   4번  187
4   5번  188
5   6번  202           C
6   7번  188      PYTHON
7   8번  190          C#